Revit 2027 API
RebarInSystem.SetBarIncluded Method
 Sets if the bar at the desired index is included or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBarIncluded(
	bool include,
	int barPositionIndex
)
Public Sub SetBarIncluded (
	include As Boolean,
	barPositionIndex As Integer
)
public:
void SetBarIncluded(
	bool include,
	int barPositionIndex
)
member SetBarIncluded :
        include : bool *
        barPositionIndex : int -> unit
Parameters
include Boolean
 True to include the bar, false to exclude the bar.
barPositionIndex Int32
 The bar index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
InapplicableDataException |  For this RebarInSystem element individual bars can't be moved, excluded or included.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace